[Killed] ArrowFunction
src/server.js:139:22
 });
 
 // Stryker restore all
-const cartaoValido = (cartao) => (
-  cartao
-  && typeof cartao === 'object'
-  && Boolean(cartao.numero)
-  && Boolean(cartao.validade)
-  && Boolean(cartao.cvv)
-);
+const cartaoValido = () => undefined;
 
 const pedidoValido = ({ clienteEmail, valor, cartao }) => (
killedBy: POST /api/v1/checkout - cache read-through consulta a fonte do catalogo uma unica vez em requisicoes repetidas (cache quente)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/server.js:140:3
 
 // Stryker restore all
 const cartaoValido = (cartao) => (
-  cartao
-  && typeof cartao === 'object'
-  && Boolean(cartao.numero)
-  && Boolean(cartao.validade)
-  && Boolean(cartao.cvv)
+  false
 );
 
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao retorna 500 com mensagem amigavel quando o checkout nao processa o pedido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] LogicalOperator
src/server.js:140:3
 
 // Stryker restore all
 const cartaoValido = (cartao) => (
-  cartao
-  && typeof cartao === 'object'
-  && Boolean(cartao.numero)
+  cartao && typeof cartao === 'object' || Boolean(cartao.numero)
   && Boolean(cartao.validade)
   && Boolean(cartao.cvv)
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao rejeita cartao nulo antes de chamar o checkout
statusReason: TypeError: Cannot read properties of null (reading 'numero')

[Killed] ConditionalExpression
src/server.js:141:6
 // Stryker restore all
 const cartaoValido = (cartao) => (
   cartao
-  && typeof cartao === 'object'
+  && true
   && Boolean(cartao.numero)
   && Boolean(cartao.validade)
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao cartao precisa ser objeto mesmo quando possui campos compativeis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/server.js:141:6
 // Stryker restore all
 const cartaoValido = (cartao) => (
   cartao
-  && typeof cartao === 'object'
+  && typeof cartao !== 'object'
   && Boolean(cartao.numero)
   && Boolean(cartao.validade)
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao cartao precisa ser objeto mesmo quando possui campos compativeis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/server.js:147:22
   && Boolean(cartao.cvv)
 );
 
-const pedidoValido = ({ clienteEmail, valor, cartao }) => (
-  typeof clienteEmail === 'string'
-  && clienteEmail.includes('@')
-  && Number.isFinite(valor)
-  && valor > 0
-  && cartaoValido(cartao)
-);
+const pedidoValido = () => undefined;
 
 const criarPedidoCheckout = ({ clienteEmail, valor, cartao }) => ({
killedBy: POST /api/v1/checkout - cache read-through consulta a fonte do catalogo uma unica vez em requisicoes repetidas (cache quente)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] LogicalOperator
src/server.js:148:3
 );
 
 const pedidoValido = ({ clienteEmail, valor, cartao }) => (
-  typeof clienteEmail === 'string'
-  && clienteEmail.includes('@')
-  && Number.isFinite(valor)
+  typeof clienteEmail === 'string' && clienteEmail.includes('@') || Number.isFinite(valor)
   && valor > 0
   && cartaoValido(cartao)
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao rejeita e-mail invalido antes de chamar o checkout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/server.js:148:3
 );
 
 const pedidoValido = ({ clienteEmail, valor, cartao }) => (
-  typeof clienteEmail === 'string'
-  && clienteEmail.includes('@')
-  && Number.isFinite(valor)
-  && valor > 0
-  && cartaoValido(cartao)
+  true
 );
 
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao rejeita e-mail invalido antes de chamar o checkout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] EqualityOperator
src/server.js:151:6
   typeof clienteEmail === 'string'
   && clienteEmail.includes('@')
   && Number.isFinite(valor)
-  && valor > 0
+  && valor >= 0
   && cartaoValido(cartao)
 );
killedBy: POST /api/v1/checkout - contrato principal rejeita valor menor ou igual a zero antes de chamar o checkout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/server.js:151:6
   typeof clienteEmail === 'string'
   && clienteEmail.includes('@')
   && Number.isFinite(valor)
-  && valor > 0
+  && true
   && cartaoValido(cartao)
 );
killedBy: POST /api/v1/checkout - contrato principal rejeita valor menor ou igual a zero antes de chamar o checkout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ArrowFunction
src/server.js:155:29
   && cartaoValido(cartao)
 );
 
-const criarPedidoCheckout = ({ clienteEmail, valor, cartao }) => ({
-  clienteEmail,
-  valor,
-  cartao,
-  status: 'PENDENTE',
-  idempotencyKey: randomUUID()
-});
+const criarPedidoCheckout = () => undefined;
 
 const checkoutProcessado = (resultado) => resultado?.status === 'PROCESSADO';
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
src/server.js:155:67
   && cartaoValido(cartao)
 );
 
-const criarPedidoCheckout = ({ clienteEmail, valor, cartao }) => ({
-  clienteEmail,
-  valor,
-  cartao,
-  status: 'PENDENTE',
-  idempotencyKey: randomUUID()
-});
+const criarPedidoCheckout = ({ clienteEmail, valor, cartao }) => ({});
 
 const checkoutProcessado = (resultado) => resultado?.status === 'PROCESSADO';
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "E-mail enviado para cliente@entregasja.com"
Received: "E-mail enviado para undefined"

Number of calls: 1

[Killed] StringLiteral
src/server.js:159:11
   clienteEmail,
   valor,
   cartao,
-  status: 'PENDENTE',
+  status: "",
   idempotencyKey: randomUUID()
 });
killedBy: POST /api/v1/checkout - contrato principal retorna 200 quando o checkout processa o pedido com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "PENDENTE"}
Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}, "clienteEmail": "cliente@entregasja.com", "idempotencyKey": "e03acfef-731d-45a9-a672-60bd4b7db7b3", "status": "", "valor": 99.9}

Number of calls: 1

[Killed] ConditionalExpression
src/server.js:163:43
   idempotencyKey: randomUUID()
 });
 
-const checkoutProcessado = (resultado) => resultado?.status === 'PROCESSADO';
+const checkoutProcessado = (resultado) => true;
 
 const respostaCheckoutProcessado = (res, pedido) => res.status(200).json({
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao retorna 500 com mensagem amigavel quando o checkout nao processa o pedido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] OptionalChaining
src/server.js:163:43
   idempotencyKey: randomUUID()
 });
 
-const checkoutProcessado = (resultado) => resultado?.status === 'PROCESSADO';
+const checkoutProcessado = (resultado) => resultado.status === 'PROCESSADO';
 
 const respostaCheckoutProcessado = (res, pedido) => res.status(200).json({
killedBy: checkoutProcessado verdadeiro apenas para status PROCESSADO
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Timeout] ArrowFunction
src/server.js:165:36
 
 const checkoutProcessado = (resultado) => resultado?.status === 'PROCESSADO';
 
-const respostaCheckoutProcessado = (res, pedido) => res.status(200).json({
-  mensagem: 'Pedido finalizado com sucesso!',
-  pedido
-});
+const respostaCheckoutProcessado = () => undefined;
 
 const respostaCheckoutNaoProcessado = (res) => res.status(500).json({

[Timeout] ArrowFunction
src/server.js:170:39
   pedido
 });
 
-const respostaCheckoutNaoProcessado = (res) => res.status(500).json({
-  erro: 'Nao foi possivel processar seu pagamento. Tente mais tarde.'
-});
+const respostaCheckoutNaoProcessado = () => undefined;
 
 const respostaCheckoutSobrecarregado = (res) => res.status(503).json({

[Killed] ObjectLiteral
src/server.js:170:69
   pedido
 });
 
-const respostaCheckoutNaoProcessado = (res) => res.status(500).json({
-  erro: 'Nao foi possivel processar seu pagamento. Tente mais tarde.'
-});
+const respostaCheckoutNaoProcessado = (res) => res.status(500).json({});
 
 const respostaCheckoutSobrecarregado = (res) => res.status(503).json({
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao retorna 500 com mensagem amigavel quando o checkout nao processa o pedido
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "erro": "Nao foi possivel processar seu pagamento. Tente mais tarde.",
- }

[Killed] StringLiteral
src/server.js:171:9
 });
 
 const respostaCheckoutNaoProcessado = (res) => res.status(500).json({
-  erro: 'Nao foi possivel processar seu pagamento. Tente mais tarde.'
+  erro: ""
 });
 
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao retorna 500 com mensagem amigavel quando o checkout nao processa o pedido
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "erro": "Nao foi possivel processar seu pagamento. Tente mais tarde.",
+   "erro": "",

[Timeout] ArrowFunction
src/server.js:174:40
   erro: 'Nao foi possivel processar seu pagamento. Tente mais tarde.'
 });
 
-const respostaCheckoutSobrecarregado = (res) => res.status(503).json({
-  erro: 'Sistema sobrecarregado. Tente novamente em instantes.'
-});
+const respostaCheckoutSobrecarregado = () => undefined;
 
 const responderResultadoCheckout = (res, resultado) => {

[Timeout] BlockStatement
src/server.js:178:56
   erro: 'Sistema sobrecarregado. Tente novamente em instantes.'
 });
 
-const responderResultadoCheckout = (res, resultado) => {
-  if (checkoutProcessado(resultado)) {
-    return respostaCheckoutProcessado(res, resultado);
-  }
-
-  return respostaCheckoutNaoProcessado(res);
-};
+const responderResultadoCheckout = (res, resultado) => {};
 
 const registrarRotasCheckout = (app, { checkoutService, bulkhead, cacheService, carregarCatalogo }) => {

[Killed] BlockStatement
src/server.js:179:38
 });
 
 const responderResultadoCheckout = (res, resultado) => {
-  if (checkoutProcessado(resultado)) {
-    return respostaCheckoutProcessado(res, resultado);
-  }
+  if (checkoutProcessado(resultado)) {}
 
   return respostaCheckoutNaoProcessado(res);
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/server.js:179:7
 });
 
 const responderResultadoCheckout = (res, resultado) => {
-  if (checkoutProcessado(resultado)) {
+  if (true) {
     return respostaCheckoutProcessado(res, resultado);
   }
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao retorna 500 com mensagem amigavel quando o checkout nao processa o pedido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
src/server.js:186:104
   return respostaCheckoutNaoProcessado(res);
 };
 
-const registrarRotasCheckout = (app, { checkoutService, bulkhead, cacheService, carregarCatalogo }) => {
-  app.post('/api/v1/checkout', async (req, res) => {
-    if (!pedidoValido(req.body)) {
-      return res.status(400).json({ erro: 'Dados incompletos para checkout' });
-    }
-
-    const pedido = criarPedidoCheckout(req.body);
-
-    try {
-      const resultado = await bulkhead.executar(async () => {
-        // Read-through: consulta o catalogo via cache (single-flight + fallback).
-        // Sob Thundering Herd, isto protege o banco da manada.
-        await cacheService.obter('catalogo:loja', carregarCatalogo);
-        return checkoutService.processar(pedido);
-      });
-      return responderResultadoCheckout(res, resultado);
-    } catch (error) {
-      if (error instanceof BulkheadCheioError) {
-        return respostaCheckoutSobrecarregado(res);
-      }
-      return respostaCheckoutNaoProcessado(res);
-    }
-  });
-};
+const registrarRotasCheckout = (app, { checkoutService, bulkhead, cacheService, carregarCatalogo }) => {};
 
 const registrarRotasOperacionais = (app, cacheService) => {
killedBy: rota de checkout - caminhos de erro e limites responde 500 (e nao 503) quando o erro NAO e de bulkhead
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Timeout] BlockStatement
src/server.js:187:52
 };
 
 const registrarRotasCheckout = (app, { checkoutService, bulkhead, cacheService, carregarCatalogo }) => {
-  app.post('/api/v1/checkout', async (req, res) => {
-    if (!pedidoValido(req.body)) {
-      return res.status(400).json({ erro: 'Dados incompletos para checkout' });
-    }
-
-    const pedido = criarPedidoCheckout(req.body);
-
-    try {
-      const resultado = await bulkhead.executar(async () => {
-        // Read-through: consulta o catalogo via cache (single-flight + fallback).
-        // Sob Thundering Herd, isto protege o banco da manada.
-        await cacheService.obter('catalogo:loja', carregarCatalogo);
-        return checkoutService.processar(pedido);
-      });
-      return responderResultadoCheckout(res, resultado);
-    } catch (error) {
-      if (error instanceof BulkheadCheioError) {
-        return respostaCheckoutSobrecarregado(res);
-      }
-      return respostaCheckoutNaoProcessado(res);
-    }
-  });
+  app.post('/api/v1/checkout', async (req, res) => {});
 };
 

[Killed] BooleanLiteral
src/server.js:188:9
 
 const registrarRotasCheckout = (app, { checkoutService, bulkhead, cacheService, carregarCatalogo }) => {
   app.post('/api/v1/checkout', async (req, res) => {
-    if (!pedidoValido(req.body)) {
+    if (pedidoValido(req.body)) {
       return res.status(400).json({ erro: 'Dados incompletos para checkout' });
     }
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao rejeita e-mail invalido antes de chamar o checkout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/server.js:188:9
 
 const registrarRotasCheckout = (app, { checkoutService, bulkhead, cacheService, carregarCatalogo }) => {
   app.post('/api/v1/checkout', async (req, res) => {
-    if (!pedidoValido(req.body)) {
+    if (true) {
       return res.status(400).json({ erro: 'Dados incompletos para checkout' });
     }
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao retorna 500 com mensagem amigavel quando o checkout nao processa o pedido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Timeout] BlockStatement
src/server.js:194:9
 
     const pedido = criarPedidoCheckout(req.body);
 
-    try {
-      const resultado = await bulkhead.executar(async () => {
-        // Read-through: consulta o catalogo via cache (single-flight + fallback).
-        // Sob Thundering Herd, isto protege o banco da manada.
-        await cacheService.obter('catalogo:loja', carregarCatalogo);
-        return checkoutService.processar(pedido);
-      });
-      return responderResultadoCheckout(res, resultado);
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof BulkheadCheioError) {
         return respostaCheckoutSobrecarregado(res);

[Killed] BlockStatement
src/server.js:195:61
     const pedido = criarPedidoCheckout(req.body);
 
     try {
-      const resultado = await bulkhead.executar(async () => {
-        // Read-through: consulta o catalogo via cache (single-flight + fallback).
-        // Sob Thundering Herd, isto protege o banco da manada.
-        await cacheService.obter('catalogo:loja', carregarCatalogo);
-        return checkoutService.processar(pedido);
-      });
+      const resultado = await bulkhead.executar(async () => {});
       return responderResultadoCheckout(res, resultado);
     } catch (error) {
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] BlockStatement
src/server.js:202:21
         return checkoutService.processar(pedido);
       });
       return responderResultadoCheckout(res, resultado);
-    } catch (error) {
-      if (error instanceof BulkheadCheioError) {
-        return respostaCheckoutSobrecarregado(res);
-      }
-      return respostaCheckoutNaoProcessado(res);
-    }
+    } catch (error) {}
   });
 };

[Killed] ConditionalExpression
src/server.js:203:11
       });
       return responderResultadoCheckout(res, resultado);
     } catch (error) {
-      if (error instanceof BulkheadCheioError) {
+      if (true) {
         return respostaCheckoutSobrecarregado(res);
       }
killedBy: rota de checkout - caminhos de erro e limites responde 500 (e nao 503) quando o erro NAO e de bulkhead
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 503

[Killed] BlockStatement
src/server.js:203:48
       });
       return responderResultadoCheckout(res, resultado);
     } catch (error) {
-      if (error instanceof BulkheadCheioError) {
-        return respostaCheckoutSobrecarregado(res);
-      }
+      if (error instanceof BulkheadCheioError) {}
       return respostaCheckoutNaoProcessado(res);
     }
killedBy: rota de checkout - caminhos de erro e limites responde 503 com mensagem de sobrecarga quando o bulkhead enche
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 503
Received: 500

[Killed] BlockStatement
src/server.js:211:59
   });
 };
 
-const registrarRotasOperacionais = (app, cacheService) => {
-  app.post('/api/v1/cache/flush', async (req, res) => {
-    console.log('CACHE LIMPO ABRUPTAMENTE!');
-    await cacheService.flush();
-    res.json({ status: 'cache_invalidated' });
-  });
-};
+const registrarRotasOperacionais = (app, cacheService) => {};
 
 const createApp = ({
killedBy: POST /api/v1/checkout - cache read-through flush do cache forca recarregar o catalogo na proxima requisicao
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Timeout] BlockStatement
src/server.js:212:55
 };
 
 const registrarRotasOperacionais = (app, cacheService) => {
-  app.post('/api/v1/cache/flush', async (req, res) => {
-    console.log('CACHE LIMPO ABRUPTAMENTE!');
-    await cacheService.flush();
-    res.json({ status: 'cache_invalidated' });
-  });
+  app.post('/api/v1/cache/flush', async (req, res) => {});
 };
 

[Killed] ObjectLiteral
src/server.js:215:14
   app.post('/api/v1/cache/flush', async (req, res) => {
     console.log('CACHE LIMPO ABRUPTAMENTE!');
     await cacheService.flush();
-    res.json({ status: 'cache_invalidated' });
+    res.json({});
   });
 };
killedBy: Rotas operacionais expoe rota para limpeza de cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "cache_invalidated",
- }

[Killed] StringLiteral
src/server.js:215:24
   app.post('/api/v1/cache/flush', async (req, res) => {
     console.log('CACHE LIMPO ABRUPTAMENTE!');
     await cacheService.flush();
-    res.json({ status: 'cache_invalidated' });
+    res.json({ status: "" });
   });
 };
killedBy: Rotas operacionais expoe rota para limpeza de cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "cache_invalidated",
+   "status": "",

[Killed] BlockStatement
src/server.js:224:12
   bulkhead = criarBulkheadPadrao(),
   cacheService = criarCacheServicePadrao(),
   carregarCatalogo = carregarCatalogoDoBanco
-} = {}) => {
-  const app = express();
-  app.use(express.json({ limit: '16kb' }));
-
-  registrarRotasCheckout(app, { checkoutService, bulkhead, cacheService, carregarCatalogo });
-  registrarRotasOperacionais(app, cacheService);
-
-  return app;
-};
+} = {}) => {};
 
 const startServer = (port = 3000) => {
killedBy: POST /api/v1/checkout - contrato principal rejeita payload sem clienteEmail antes de chamar o checkout
statusReason: TypeError: Cannot read properties of undefined (reading 'address')

[Killed] ObjectLiteral
src/server.js:226:24
   carregarCatalogo = carregarCatalogoDoBanco
 } = {}) => {
   const app = express();
-  app.use(express.json({ limit: '16kb' }));
+  app.use(express.json({}));
 
   registrarRotasCheckout(app, { checkoutService, bulkhead, cacheService, carregarCatalogo });
killedBy: rota de checkout - caminhos de erro e limites rejeita corpo acima do limite de 16kb com 413
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 413
Received: 400

[Killed] StringLiteral
src/server.js:226:33
   carregarCatalogo = carregarCatalogoDoBanco
 } = {}) => {
   const app = express();
-  app.use(express.json({ limit: '16kb' }));
+  app.use(express.json({ limit: "" }));
 
   registrarRotasCheckout(app, { checkoutService, bulkhead, cacheService, carregarCatalogo });
killedBy: rota de checkout - caminhos de erro e limites rejeita corpo acima do limite de 16kb com 413
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 413
Received: 400

[Killed] BlockStatement
src/server.js:234:38
   return app;
 };
 
-const startServer = (port = 3000) => {
-  const app = createApp();
-  return app.listen(port, () => {
-    console.log(`Servidor da EntregasJa rodando na porta ${port}`);
-  });
-};
+const startServer = (port = 3000) => {};
 
 // Stryker disable next-line all: bootstrap manual da aplicacao, fora da regra de negocio testada
killedBy: Bootstrap HTTP startServer inicializa e retorna um servidor fechavel
statusReason: TypeError: Cannot read properties of undefined (reading 'on')

[Killed] BlockStatement
src/server.js:236:33
 
 const startServer = (port = 3000) => {
   const app = createApp();
-  return app.listen(port, () => {
-    console.log(`Servidor da EntregasJa rodando na porta ${port}`);
-  });
+  return app.listen(port, () => {});
 };
 
killedBy: Bootstrap HTTP startServer inicializa e retorna um servidor fechavel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Servidor da EntregasJa rodando na porta 0"

Number of calls: 0

[Killed] StringLiteral
src/server.js:237:17
 const startServer = (port = 3000) => {
   const app = createApp();
   return app.listen(port, () => {
-    console.log(`Servidor da EntregasJa rodando na porta ${port}`);
+    console.log(``);
   });
 };
killedBy: Bootstrap HTTP startServer inicializa e retorna um servidor fechavel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Servidor da EntregasJa rodando na porta 0"
Received: ""

Number of calls: 1
