[Killed] BlockStatement
src/services/Bulkhead.js:2:76
 class BulkheadCheioError extends Error {
-  constructor(message = 'Bulkhead cheio: limite de concorrencia atingido') {
-    super(message);
-    this.name = 'BulkheadCheioError';
-  }
+  constructor(message = 'Bulkhead cheio: limite de concorrencia atingido') {}
 }
 
killedBy: rota de checkout - caminhos de erro e limites responde 503 com mensagem de sobrecarga quando o bulkhead enche
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 503
Received: 500

[Killed] StringLiteral
src/services/Bulkhead.js:2:25
 class BulkheadCheioError extends Error {
-  constructor(message = 'Bulkhead cheio: limite de concorrencia atingido') {
+  constructor(message = "") {
     super(message);
     this.name = 'BulkheadCheioError';
killedBy: Bulkhead BulkheadCheioError carrega nome e mensagem descritivos
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Bulkhead cheio"
Received string:    ""

[Killed] LogicalOperator
src/services/Bulkhead.js:10:26
 
 class Bulkhead {
   constructor(options = {}) {
-    this.maxConcurrent = options.maxConcurrent ?? 10;
+    this.maxConcurrent = options.maxConcurrent && 10;
     this.maxQueue = options.maxQueue ?? 0;
     this.emExecucao = 0;
killedBy: Bulkhead rejeita com BulkheadCheioError quando concorrencia e fila estao cheias
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: "x"

[Killed] BlockStatement
src/services/Bulkhead.js:16:25
     this.fila = [];
   }
 
-  get emExecucaoAtual() {
-    return this.emExecucao;
-  }
+  get emExecucaoAtual() {}
 
   get naFila() {
killedBy: Bulkhead executa ate o limite de concorrencia simultaneamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/services/Bulkhead.js:20:16
     return this.emExecucao;
   }
 
-  get naFila() {
-    return this.fila.length;
-  }
+  get naFila() {}
 
   async executar(fn) {
killedBy: Bulkhead enfileira ate maxQueue e processa quando um slot libera
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/services/Bulkhead.js:24:22
     return this.fila.length;
   }
 
-  async executar(fn) {
-    if (this.emExecucao >= this.maxConcurrent) {
-      if (this.fila.length >= this.maxQueue) {
-        throw new BulkheadCheioError();
-      }
-
-      await new Promise((resolve) => this.fila.push(resolve));
-    }
-
-    this.emExecucao += 1;
-
-    try {
-      return await fn();
-    } finally {
-      this.emExecucao -= 1;
-      this._liberarProximo();
-    }
-  }
+  async executar(fn) {}
 
   _liberarProximo() {
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/Bulkhead.js:25:48
   }
 
   async executar(fn) {
-    if (this.emExecucao >= this.maxConcurrent) {
-      if (this.fila.length >= this.maxQueue) {
-        throw new BulkheadCheioError();
-      }
-
-      await new Promise((resolve) => this.fila.push(resolve));
-    }
+    if (this.emExecucao >= this.maxConcurrent) {}
 
     this.emExecucao += 1;
killedBy: Bulkhead rejeita com BulkheadCheioError quando concorrencia e fila estao cheias
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: "x"

[Killed] EqualityOperator
src/services/Bulkhead.js:25:9
   }
 
   async executar(fn) {
-    if (this.emExecucao >= this.maxConcurrent) {
+    if (this.emExecucao > this.maxConcurrent) {
       if (this.fila.length >= this.maxQueue) {
         throw new BulkheadCheioError();
killedBy: Bulkhead rejeita com BulkheadCheioError quando concorrencia e fila estao cheias
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: "x"

[Timeout] ConditionalExpression
src/services/Bulkhead.js:26:11
 
   async executar(fn) {
     if (this.emExecucao >= this.maxConcurrent) {
-      if (this.fila.length >= this.maxQueue) {
+      if (false) {
         throw new BulkheadCheioError();
       }

[Timeout] EqualityOperator
src/services/Bulkhead.js:26:11
 
   async executar(fn) {
     if (this.emExecucao >= this.maxConcurrent) {
-      if (this.fila.length >= this.maxQueue) {
+      if (this.fila.length < this.maxQueue) {
         throw new BulkheadCheioError();
       }

[Killed] ArrowFunction
src/services/Bulkhead.js:30:25
         throw new BulkheadCheioError();
       }
 
-      await new Promise((resolve) => this.fila.push(resolve));
+      await new Promise(() => undefined);
     }
 
killedBy: Bulkhead enfileira ate maxQueue e processa quando um slot libera
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] AssignmentOperator
src/services/Bulkhead.js:33:5
       await new Promise((resolve) => this.fila.push(resolve));
     }
 
-    this.emExecucao += 1;
+    this.emExecucao -= 1;
 
     try {
killedBy: Bulkhead executa ate o limite de concorrencia simultaneamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] BlockStatement
src/services/Bulkhead.js:37:15
 
     try {
       return await fn();
-    } finally {
-      this.emExecucao -= 1;
-      this._liberarProximo();
-    }
+    } finally {}
   }
 
killedBy: Bulkhead enfileira ate maxQueue e processa quando um slot libera
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] AssignmentOperator
src/services/Bulkhead.js:38:7
     try {
       return await fn();
     } finally {
-      this.emExecucao -= 1;
+      this.emExecucao += 1;
       this._liberarProximo();
     }
killedBy: Bulkhead libera o slot mesmo quando a tarefa falha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
src/services/Bulkhead.js:43:21
     }
   }
 
-  _liberarProximo() {
-    const proximo = this.fila.shift();
-
-    if (proximo) {
-      proximo();
-    }
-  }
+  _liberarProximo() {}
 }
 
killedBy: Bulkhead enfileira ate maxQueue e processa quando um slot libera
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/services/Bulkhead.js:46:18
   _liberarProximo() {
     const proximo = this.fila.shift();
 
-    if (proximo) {
-      proximo();
-    }
+    if (proximo) {}
   }
 }
killedBy: Bulkhead enfileira ate maxQueue e processa quando um slot libera
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/services/Bulkhead.js:46:9
   _liberarProximo() {
     const proximo = this.fila.shift();
 
-    if (proximo) {
+    if (false) {
       proximo();
     }
killedBy: Bulkhead enfileira ate maxQueue e processa quando um slot libera
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
