[Killed] BlockStatement
src/services/CacheService.js:2:40
 class InMemoryCacheStore {
-  constructor({ now = Date.now } = {}) {
-    this.now = now;
-    this.mapa = new Map();
-  }
+  constructor({ now = Date.now } = {}) {}
 
   async get(chave) {
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Killed] BlockStatement
src/services/CacheService.js:7:20
     this.mapa = new Map();
   }
 
-  async get(chave) {
-    const item = this.mapa.get(chave);
-
-    if (!item) {
-      return null;
-    }
-
-    if (item.expiraEm <= this.now()) {
-      this.mapa.delete(chave);
-      return null;
-    }
-
-    return item.valor;
-  }
+  async get(chave) {}
 
   async set(chave, valor, ttlMs) {
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "v"
Received: undefined

[Killed] BooleanLiteral
src/services/CacheService.js:10:9
   async get(chave) {
     const item = this.mapa.get(chave);
 
-    if (!item) {
+    if (item) {
       return null;
     }
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "v"
Received: null

[Killed] ConditionalExpression
src/services/CacheService.js:10:9
   async get(chave) {
     const item = this.mapa.get(chave);
 
-    if (!item) {
+    if (true) {
       return null;
     }
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "v"
Received: null

[Killed] EqualityOperator
src/services/CacheService.js:14:9
       return null;
     }
 
-    if (item.expiraEm <= this.now()) {
+    if (item.expiraEm < this.now()) {
       this.mapa.delete(chave);
       return null;
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBeNull()

Received: "v"

[Killed] ConditionalExpression
src/services/CacheService.js:14:9
       return null;
     }
 
-    if (item.expiraEm <= this.now()) {
+    if (false) {
       this.mapa.delete(chave);
       return null;
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBeNull()

Received: "v"

[Killed] BlockStatement
src/services/CacheService.js:22:34
     return item.valor;
   }
 
-  async set(chave, valor, ttlMs) {
-    this.mapa.set(chave, { valor, expiraEm: this.now() + ttlMs });
-  }
+  async set(chave, valor, ttlMs) {}
 
   async flush() {
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "v"
Received: null

[Killed] ArithmeticOperator
src/services/CacheService.js:23:45
   }
 
   async set(chave, valor, ttlMs) {
-    this.mapa.set(chave, { valor, expiraEm: this.now() + ttlMs });
+    this.mapa.set(chave, { valor, expiraEm: this.now() - ttlMs });
   }
 
killedBy: InMemoryCacheStore expira itens pelo TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "v"
Received: null

[Killed] BlockStatement
src/services/CacheService.js:26:17
     this.mapa.set(chave, { valor, expiraEm: this.now() + ttlMs });
   }
 
-  async flush() {
-    this.mapa.clear();
-  }
+  async flush() {}
 }
 
killedBy: CacheService flush limpa o cache e forca recarga
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/services/CacheService.js:32:87
 }
 
 class CacheService {
-  constructor({ store, ttlMs = 30000, jitterRatio = 0.2, random = Math.random } = {}) {
-    this.store = store;
-    this.ttlMs = ttlMs;
-    this.jitterRatio = jitterRatio;
-    this.random = random;
-    this.emVoo = new Map();
-  }
+  constructor({ store, ttlMs = 30000, jitterRatio = 0.2, random = Math.random } = {}) {}
 
   async obter(chave, carregar) {
killedBy: CacheService cache miss carrega da fonte e cache hit nao recarrega
statusReason: TypeError: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/services/CacheService.js:40:32
     this.emVoo = new Map();
   }
 
-  async obter(chave, carregar) {
-    const cacheado = await this._lerSeguro(chave);
-
-    if (cacheado !== undefined && cacheado !== null) {
-      return cacheado;
-    }
-
-    if (this.emVoo.has(chave)) {
-      return this.emVoo.get(chave);
-    }
-
-    const promise = this._carregarEArmazenar(chave, carregar);
-    this.emVoo.set(chave, promise);
-
-    try {
-      return await promise;
-    } finally {
-      this.emVoo.delete(chave);
-    }
-  }
+  async obter(chave, carregar) {}
 
   async flush() {
killedBy: POST /api/v1/checkout - cache read-through consulta a fonte do catalogo uma unica vez em requisicoes repetidas (cache quente)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/services/CacheService.js:43:9
   async obter(chave, carregar) {
     const cacheado = await this._lerSeguro(chave);
 
-    if (cacheado !== undefined && cacheado !== null) {
+    if (cacheado === undefined && cacheado !== null) {
       return cacheado;
     }
killedBy: CacheService cache miss carrega da fonte e cache hit nao recarrega
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/CacheService.js:43:54
   async obter(chave, carregar) {
     const cacheado = await this._lerSeguro(chave);
 
-    if (cacheado !== undefined && cacheado !== null) {
-      return cacheado;
-    }
+    if (cacheado !== undefined && cacheado !== null) {}
 
     if (this.emVoo.has(chave)) {
killedBy: CacheService cache miss carrega da fonte e cache hit nao recarrega
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/services/CacheService.js:47:9
       return cacheado;
     }
 
-    if (this.emVoo.has(chave)) {
+    if (true) {
       return this.emVoo.get(chave);
     }
killedBy: POST /api/v1/checkout - cache read-through consulta a fonte do catalogo uma unica vez em requisicoes repetidas (cache quente)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/CacheService.js:47:32
       return cacheado;
     }
 
-    if (this.emVoo.has(chave)) {
-      return this.emVoo.get(chave);
-    }
+    if (this.emVoo.has(chave)) {}
 
     const promise = this._carregarEArmazenar(chave, carregar);
killedBy: CacheService single-flight: chamadas concorrentes em cache vazio carregam a fonte uma unica vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] BlockStatement
src/services/CacheService.js:56:15
 
     try {
       return await promise;
-    } finally {
-      this.emVoo.delete(chave);
-    }
+    } finally {}
   }
 
killedBy: POST /api/v1/checkout - cache read-through flush do cache forca recarregar o catalogo na proxima requisicao
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/services/CacheService.js:61:17
     }
   }
 
-  async flush() {
-    try {
-      await this.store.flush();
-    } catch (error) {
-      console.error('Cache indisponivel no flush:', error.message);
-    }
-  }
+  async flush() {}
 
   async _lerSeguro(chave) {
killedBy: POST /api/v1/checkout - cache read-through flush do cache forca recarregar o catalogo na proxima requisicao
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/services/CacheService.js:62:9
   }
 
   async flush() {
-    try {
-      await this.store.flush();
-    } catch (error) {
+    try {} catch (error) {
       console.error('Cache indisponivel no flush:', error.message);
     }
killedBy: POST /api/v1/checkout - cache read-through flush do cache forca recarregar o catalogo na proxima requisicao
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/services/CacheService.js:64:21
   async flush() {
     try {
       await this.store.flush();
-    } catch (error) {
-      console.error('Cache indisponivel no flush:', error.message);
-    }
+    } catch (error) {}
   }
 
killedBy: CacheService flush degrada graciosamente quando o store falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/services/CacheService.js:69:27
     }
   }
 
-  async _lerSeguro(chave) {
-    try {
-      return await this.store.get(chave);
-    } catch (error) {
-      console.error('Cache indisponivel na leitura:', error.message);
-      return null;
-    }
-  }
+  async _lerSeguro(chave) {}
 
   async _carregarEArmazenar(chave, carregar) {
killedBy: POST /api/v1/checkout - cache read-through consulta a fonte do catalogo uma unica vez em requisicoes repetidas (cache quente)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/CacheService.js:70:9
   }
 
   async _lerSeguro(chave) {
-    try {
-      return await this.store.get(chave);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Cache indisponivel na leitura:', error.message);
       return null;
killedBy: POST /api/v1/checkout - cache read-through consulta a fonte do catalogo uma unica vez em requisicoes repetidas (cache quente)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/CacheService.js:72:21
   async _lerSeguro(chave) {
     try {
       return await this.store.get(chave);
-    } catch (error) {
-      console.error('Cache indisponivel na leitura:', error.message);
-      return null;
-    }
+    } catch (error) {}
   }
 
killedBy: CacheService degrada graciosamente quando o store falha na leitura
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/services/CacheService.js:78:46
     }
   }
 
-  async _carregarEArmazenar(chave, carregar) {
-    const valor = await carregar();
-
-    try {
-      await this.store.set(chave, valor, this._ttlComJitter());
-    } catch (error) {
-      console.error('Cache indisponivel na escrita:', error.message);
-    }
-
-    return valor;
-  }
+  async _carregarEArmazenar(chave, carregar) {}
 
   _ttlComJitter() {
killedBy: CacheService cache miss carrega da fonte e cache hit nao recarrega
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"preco": 10}
Received: undefined

[Killed] BlockStatement
src/services/CacheService.js:81:9
   async _carregarEArmazenar(chave, carregar) {
     const valor = await carregar();
 
-    try {
-      await this.store.set(chave, valor, this._ttlComJitter());
-    } catch (error) {
+    try {} catch (error) {
       console.error('Cache indisponivel na escrita:', error.message);
     }
killedBy: CacheService cache miss carrega da fonte e cache hit nao recarrega
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/CacheService.js:83:21
 
     try {
       await this.store.set(chave, valor, this._ttlComJitter());
-    } catch (error) {
-      console.error('Cache indisponivel na escrita:', error.message);
-    }
+    } catch (error) {}
 
     return valor;
killedBy: CacheService mantem o valor mesmo quando a escrita no store falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/services/CacheService.js:84:21
     try {
       await this.store.set(chave, valor, this._ttlComJitter());
     } catch (error) {
-      console.error('Cache indisponivel na escrita:', error.message);
+      console.error("", error.message);
     }
 

[Killed] BlockStatement
src/services/CacheService.js:90:19
     return valor;
   }
 
-  _ttlComJitter() {
-    const jitter = this.random() * this.ttlMs * this.jitterRatio;
-    return Math.round(this.ttlMs + jitter);
-  }
+  _ttlComJitter() {}
 }
 
killedBy: CacheService aplica TTL com jitter ao gravar no store
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "k", "v", 1200
Received: "k", "v", undefined

Number of calls: 1

[Killed] ArithmeticOperator
src/services/CacheService.js:91:20
   }
 
   _ttlComJitter() {
-    const jitter = this.random() * this.ttlMs * this.jitterRatio;
+    const jitter = this.random() * this.ttlMs / this.jitterRatio;
     return Math.round(this.ttlMs + jitter);
   }
killedBy: CacheService aplica TTL com jitter ao gravar no store
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "k", "v", 1200
Received: "k", "v", 6000

Number of calls: 1

[Killed] ArithmeticOperator
src/services/CacheService.js:91:20
   }
 
   _ttlComJitter() {
-    const jitter = this.random() * this.ttlMs * this.jitterRatio;
+    const jitter = this.random() / this.ttlMs * this.jitterRatio;
     return Math.round(this.ttlMs + jitter);
   }
killedBy: CacheService aplica TTL com jitter ao gravar no store
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "k", "v", 1200
Received: "k", "v", 1000

Number of calls: 1

[Killed] ArithmeticOperator
src/services/CacheService.js:92:23
 
   _ttlComJitter() {
     const jitter = this.random() * this.ttlMs * this.jitterRatio;
-    return Math.round(this.ttlMs + jitter);
+    return Math.round(this.ttlMs - jitter);
   }
 }
killedBy: CacheService aplica TTL com jitter ao gravar no store
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "k", "v", 1200
Received: "k", "v", 800

Number of calls: 1

[Killed] BlockStatement
src/services/CacheService.js:97:27
 }
 
 class RedisCacheStore {
-  constructor({ client }) {
-    this.client = client;
-  }
+  constructor({ client }) {}
 
   async get(chave) {
killedBy: RedisCacheStore get desserializa o JSON armazenado no Redis
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/services/CacheService.js:101:20
     this.client = client;
   }
 
-  async get(chave) {
-    const bruto = await this.client.get(chave);
-
-    if (bruto === null || bruto === undefined) {
-      return null;
-    }
-
-    return JSON.parse(bruto);
-  }
+  async get(chave) {}
 
   async set(chave, valor, ttlMs) {
killedBy: RedisCacheStore get desserializa o JSON armazenado no Redis
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"loja": "ok"}
Received: undefined

[Killed] LogicalOperator
src/services/CacheService.js:104:9
   async get(chave) {
     const bruto = await this.client.get(chave);
 
-    if (bruto === null || bruto === undefined) {
+    if (bruto === null && bruto === undefined) {
       return null;
     }
killedBy: RedisCacheStore get retorna null quando o client devolve undefined
statusReason: SyntaxError: "undefined" is not valid JSON

[Killed] EqualityOperator
src/services/CacheService.js:104:9
   async get(chave) {
     const bruto = await this.client.get(chave);
 
-    if (bruto === null || bruto === undefined) {
+    if (bruto !== null || bruto === undefined) {
       return null;
     }
killedBy: RedisCacheStore get desserializa o JSON armazenado no Redis
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"loja": "ok"}
Received: null

[Killed] BlockStatement
src/services/CacheService.js:111:34
     return JSON.parse(bruto);
   }
 
-  async set(chave, valor, ttlMs) {
-    await this.client.set(chave, JSON.stringify(valor), { PX: ttlMs });
-  }
+  async set(chave, valor, ttlMs) {}
 
   async flush() {
killedBy: RedisCacheStore set grava JSON com expiracao em milissegundos (PX)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "k", "{\"loja\":\"ok\"}", {"PX": 1500}

Number of calls: 0

[Killed] BlockStatement
src/services/CacheService.js:115:17
     await this.client.set(chave, JSON.stringify(valor), { PX: ttlMs });
   }
 
-  async flush() {
-    await this.client.flushDb();
-  }
+  async flush() {}
 }
 
killedBy: RedisCacheStore flush chama flushDb no client
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
