[Killed] BlockStatement
src/services/CheckoutService.js:2:43
 class CheckoutService {
-  constructor(dependencies, options = {}) {
-    this.gatewayPagamento = dependencies.gatewayPagamento;
-    this.pedidoRepository = dependencies.pedidoRepository;
-    this.emailService = dependencies.emailService;
-    this.timeoutMs = options.timeoutMs ?? 2000;
-    this.repoTimeoutMs = options.repoTimeoutMs ?? this.timeoutMs;
-    this.maxRetries = options.maxRetries ?? 3;
-    this.retryDelayMs = options.retryDelayMs ?? 500;
-    this.jitterRatio = options.jitterRatio ?? 0.2;
-    this.random = options.random ?? Math.random;
-    this.circuitBreaker = options.circuitBreaker;
-    this.resultadoPagamentoHandlers = criarResultadoPagamentoHandlers(this);
-  }
+  constructor(dependencies, options = {}) {}
 
   async processar(pedido) {
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] LogicalOperator
src/services/CheckoutService.js:6:22
     this.gatewayPagamento = dependencies.gatewayPagamento;
     this.pedidoRepository = dependencies.pedidoRepository;
     this.emailService = dependencies.emailService;
-    this.timeoutMs = options.timeoutMs ?? 2000;
+    this.timeoutMs = options.timeoutMs && 2000;
     this.repoTimeoutMs = options.repoTimeoutMs ?? this.timeoutMs;
     this.maxRetries = options.maxRetries ?? 3;
killedBy: CheckoutService - contratos adicionais para teste de mutacao preserva opcoes customizadas de resiliencia no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 123
Received: 2000

[Killed] LogicalOperator
src/services/CheckoutService.js:7:26
     this.pedidoRepository = dependencies.pedidoRepository;
     this.emailService = dependencies.emailService;
     this.timeoutMs = options.timeoutMs ?? 2000;
-    this.repoTimeoutMs = options.repoTimeoutMs ?? this.timeoutMs;
+    this.repoTimeoutMs = options.repoTimeoutMs && this.timeoutMs;
     this.maxRetries = options.maxRetries ?? 3;
     this.retryDelayMs = options.retryDelayMs ?? 500;
killedBy: CheckoutService - reforco de mutacao persistir rejeita com TIMEOUT_REPOSITORIO quando o repositorio nao responde
statusReason: Error: thrown: "Exceeded timeout of 1500 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
src/services/CheckoutService.js:8:23
     this.emailService = dependencies.emailService;
     this.timeoutMs = options.timeoutMs ?? 2000;
     this.repoTimeoutMs = options.repoTimeoutMs ?? this.timeoutMs;
-    this.maxRetries = options.maxRetries ?? 3;
+    this.maxRetries = options.maxRetries && 3;
     this.retryDelayMs = options.retryDelayMs ?? 500;
     this.jitterRatio = options.jitterRatio ?? 0.2;
killedBy: CheckoutService - contratos adicionais para teste de mutacao preserva opcoes customizadas de resiliencia no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] LogicalOperator
src/services/CheckoutService.js:9:25
     this.timeoutMs = options.timeoutMs ?? 2000;
     this.repoTimeoutMs = options.repoTimeoutMs ?? this.timeoutMs;
     this.maxRetries = options.maxRetries ?? 3;
-    this.retryDelayMs = options.retryDelayMs ?? 500;
+    this.retryDelayMs = options.retryDelayMs && 500;
     this.jitterRatio = options.jitterRatio ?? 0.2;
     this.random = options.random ?? Math.random;
killedBy: CheckoutService - contratos adicionais para teste de mutacao preserva opcoes customizadas de resiliencia no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 500

[Killed] LogicalOperator
src/services/CheckoutService.js:10:24
     this.repoTimeoutMs = options.repoTimeoutMs ?? this.timeoutMs;
     this.maxRetries = options.maxRetries ?? 3;
     this.retryDelayMs = options.retryDelayMs ?? 500;
-    this.jitterRatio = options.jitterRatio ?? 0.2;
+    this.jitterRatio = options.jitterRatio && 0.2;
     this.random = options.random ?? Math.random;
     this.circuitBreaker = options.circuitBreaker;
killedBy: CheckoutService.processar - resiliencia e caos usa backoff com jitter entre tentativas de gateway
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 15
Received: 12

Number of calls: 1

[Killed] LogicalOperator
src/services/CheckoutService.js:11:19
     this.maxRetries = options.maxRetries ?? 3;
     this.retryDelayMs = options.retryDelayMs ?? 500;
     this.jitterRatio = options.jitterRatio ?? 0.2;
-    this.random = options.random ?? Math.random;
+    this.random = options.random && Math.random;
     this.circuitBreaker = options.circuitBreaker;
     this.resultadoPagamentoHandlers = criarResultadoPagamentoHandlers(this);
killedBy: CheckoutService.processar - resiliencia e caos recupera erro transitorio de infraestrutura com retry e conclui como PROCESSADO
statusReason: TypeError: this.random is not a function

[Killed] BlockStatement
src/services/CheckoutService.js:16:27
     this.resultadoPagamentoHandlers = criarResultadoPagamentoHandlers(this);
   }
 
-  async processar(pedido) {
-    if (this.gatewayIndisponivel()) {
-      return this.registrarErroGateway(pedido);
-    }
-
-    const resposta = await this.cobrarComResiliencia(pedido);
-
-    if (!resposta) {
-      return this.registrarErroGateway(pedido);
-    }
-
-    try {
-      return await this.processarResultadoPagamento(pedido, resposta);
-    } catch (error) {
-      console.error('Falha ao persistir ou finalizar pedido:', error.message);
-      return this.registrarErroGateway(pedido);
-    }
-  }
+  async processar(pedido) {}
 
   gatewayIndisponivel() {
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutService.js:17:37
   }
 
   async processar(pedido) {
-    if (this.gatewayIndisponivel()) {
-      return this.registrarErroGateway(pedido);
-    }
+    if (this.gatewayIndisponivel()) {}
 
     const resposta = await this.cobrarComResiliencia(pedido);
killedBy: CheckoutService.processar - resiliencia e caos aciona fallback sem chamar gateway quando circuit breaker esta aberto
statusReason: Error: expect(received).toBeNull()

Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}, "clienteEmail": "cliente@entregasja.com", "id": 10, "status": "PROCESSADO", "valor": 120.5}

[Killed] ConditionalExpression
src/services/CheckoutService.js:17:9
   }
 
   async processar(pedido) {
-    if (this.gatewayIndisponivel()) {
+    if (true) {
       return this.registrarErroGateway(pedido);
     }
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/services/CheckoutService.js:23:9
 
     const resposta = await this.cobrarComResiliencia(pedido);
 
-    if (!resposta) {
+    if (false) {
       return this.registrarErroGateway(pedido);
     }
killedBy: CheckoutService - contratos adicionais para teste de mutacao nao tenta processar resultado de pagamento quando gateway nao retorna resposta
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}, "clienteEmail": "cliente@entregasja.com", "status": "ERRO_GATEWAY", "valor": 120.5}, null

[Killed] ConditionalExpression
src/services/CheckoutService.js:23:9
 
     const resposta = await this.cobrarComResiliencia(pedido);
 
-    if (!resposta) {
+    if (true) {
       return this.registrarErroGateway(pedido);
     }
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutService.js:27:9
       return this.registrarErroGateway(pedido);
     }
 
-    try {
-      return await this.processarResultadoPagamento(pedido, resposta);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Falha ao persistir ou finalizar pedido:', error.message);
       return this.registrarErroGateway(pedido);
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutService.js:29:21
 
     try {
       return await this.processarResultadoPagamento(pedido, resposta);
-    } catch (error) {
-      console.error('Falha ao persistir ou finalizar pedido:', error.message);
-      return this.registrarErroGateway(pedido);
-    }
+    } catch (error) {}
   }
 
killedBy: CheckoutService - contratos adicionais para teste de mutacao registra ERRO_GATEWAY quando a persistencia falha apos pagamento aprovado
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:35:25
     }
   }
 
-  gatewayIndisponivel() {
-    return this.circuitBreaker?.isOpen?.();
-  }
+  gatewayIndisponivel() {}
 
   processarResultadoPagamento(pedido, resposta) {
killedBy: CheckoutService.processar - resiliencia e caos aciona fallback sem chamar gateway quando circuit breaker esta aberto
statusReason: Error: expect(received).toBeNull()

Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}, "clienteEmail": "cliente@entregasja.com", "id": 10, "status": "PROCESSADO", "valor": 120.5}

[Killed] OptionalChaining
src/services/CheckoutService.js:36:12
   }
 
   gatewayIndisponivel() {
-    return this.circuitBreaker?.isOpen?.();
+    return this.circuitBreaker.isOpen?.();
   }
 
killedBy: CheckoutService - contratos adicionais para teste de mutacao registra ERRO_GATEWAY quando a persistencia falha apos pagamento aprovado
statusReason: TypeError: Cannot read properties of undefined (reading 'isOpen')

[Killed] OptionalChaining
src/services/CheckoutService.js:36:12
   }
 
   gatewayIndisponivel() {
-    return this.circuitBreaker?.isOpen?.();
+    return this.circuitBreaker?.isOpen();
   }
 
killedBy: CheckoutService - contratos adicionais para teste de mutacao nao quebra quando circuit breaker existe sem metodo isOpen
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "this.circuitBreaker?.isOpen is not a function"

      110 |     } else {
      111 |       stryCov_9fa48("280");
    > 112 |       return stryMutAct_9fa48("282") ? this.circuitBreaker.isOpen?.() : stryMutAct_9fa48("281") ? this.circuitBreaker?.isOpen() : (stryCov_9fa48("281", "282"), this.circuitBreaker?.isOpen?.());

[Killed] BlockStatement
src/services/CheckoutService.js:39:49
     return this.circuitBreaker?.isOpen?.();
   }
 
-  processarResultadoPagamento(pedido, resposta) {
-    return this.obterHandlerResultadoPagamento(resposta).processar(pedido);
-  }
+  processarResultadoPagamento(pedido, resposta) {}
 
   obterHandlerResultadoPagamento(resposta) {
killedBy: CheckoutService.processar - resiliencia e caos recupera erro transitorio de infraestrutura com retry e conclui como PROCESSADO
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:43:44
     return this.obterHandlerResultadoPagamento(resposta).processar(pedido);
   }
 
-  obterHandlerResultadoPagamento(resposta) {
-    return this.resultadoPagamentoHandlers[resposta.status] ?? this.resultadoPagamentoHandlers.RECUSADO;
-  }
+  obterHandlerResultadoPagamento(resposta) {}
 
   async cobrarComResiliencia(pedido) {
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] LogicalOperator
src/services/CheckoutService.js:44:12
   }
 
   obterHandlerResultadoPagamento(resposta) {
-    return this.resultadoPagamentoHandlers[resposta.status] ?? this.resultadoPagamentoHandlers.RECUSADO;
+    return this.resultadoPagamentoHandlers[resposta.status] && this.resultadoPagamentoHandlers.RECUSADO;
   }
 
killedBy: CheckoutService - reforco de mutacao processa com sucesso mesmo se o circuit breaker nao expoe registrarSucesso
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:47:38
     return this.resultadoPagamentoHandlers[resposta.status] ?? this.resultadoPagamentoHandlers.RECUSADO;
   }
 
-  async cobrarComResiliencia(pedido) {
-    const totalTentativas = this.maxRetries + 1;
-
-    for (let tentativa = 1; tentativa <= totalTentativas; tentativa += 1) {
-      try {
-        const resposta = await this.comTimeout(
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao, pedido.idempotencyKey)
-        );
-        this.circuitBreaker?.registrarSucesso?.();
-        return resposta;
-      } catch (error) {
-        console.error('Falha no gateway de pagamento:', error.message);
-        this.circuitBreaker?.registrarFalha?.();
-
-        if (tentativa === totalTentativas) {
-          return null;
-        }
-
-        await this.esperar(this.calcularBackoffComJitter(tentativa));
-      }
-    }
-
-    return null;
-  }
+  async cobrarComResiliencia(pedido) {}
 
   comTimeout(operacao, timeoutMs = this.timeoutMs, mensagemErro = 'TIMEOUT_GATEWAY') {
killedBy: CheckoutService - contratos adicionais para teste de mutacao registra ERRO_GATEWAY quando a persistencia falha apos pagamento aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao persistir ou finalizar pedido:", "db indisponivel"
Received: "Falha ao persistir status de erro do pedido:", "db indisponivel"

Number of calls: 1

[Killed] ArithmeticOperator
src/services/CheckoutService.js:48:29
   }
 
   async cobrarComResiliencia(pedido) {
-    const totalTentativas = this.maxRetries + 1;
+    const totalTentativas = this.maxRetries - 1;
 
     for (let tentativa = 1; tentativa <= totalTentativas; tentativa += 1) {
killedBy: CheckoutService - contratos adicionais para teste de mutacao nao aplica backoff apos a ultima tentativa de gateway
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha no gateway de pagamento:", "gateway indisponivel"

Number of calls: 0

[Killed] ConditionalExpression
src/services/CheckoutService.js:50:29
   async cobrarComResiliencia(pedido) {
     const totalTentativas = this.maxRetries + 1;
 
-    for (let tentativa = 1; tentativa <= totalTentativas; tentativa += 1) {
+    for (let tentativa = 1; false; tentativa += 1) {
       try {
         const resposta = await this.comTimeout(
killedBy: CheckoutService - reforco de mutacao processa com sucesso mesmo se o circuit breaker nao expoe registrarSucesso
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] EqualityOperator
src/services/CheckoutService.js:50:29
   async cobrarComResiliencia(pedido) {
     const totalTentativas = this.maxRetries + 1;
 
-    for (let tentativa = 1; tentativa <= totalTentativas; tentativa += 1) {
+    for (let tentativa = 1; tentativa < totalTentativas; tentativa += 1) {
       try {
         const resposta = await this.comTimeout(
killedBy: CheckoutService.processar - resiliencia e caos aplica timeout, esgota retentativas e salva pedido como ERRO_GATEWAY
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] BlockStatement
src/services/CheckoutService.js:51:11
     const totalTentativas = this.maxRetries + 1;
 
     for (let tentativa = 1; tentativa <= totalTentativas; tentativa += 1) {
-      try {
-        const resposta = await this.comTimeout(
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao, pedido.idempotencyKey)
-        );
-        this.circuitBreaker?.registrarSucesso?.();
-        return resposta;
-      } catch (error) {
+      try {} catch (error) {
         console.error('Falha no gateway de pagamento:', error.message);
         this.circuitBreaker?.registrarFalha?.();
killedBy: POST /api/v1/checkout - contratos adicionais para mutacao usa as dependencias padrao do app para processar checkout realista
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] OptionalChaining
src/services/CheckoutService.js:55:9
         const resposta = await this.comTimeout(
           this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao, pedido.idempotencyKey)
         );
-        this.circuitBreaker?.registrarSucesso?.();
+        this.circuitBreaker?.registrarSucesso();
         return resposta;
       } catch (error) {
killedBy: CheckoutService - reforco de mutacao processa com sucesso mesmo se o circuit breaker nao expoe registrarSucesso
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Timeout] OptionalChaining
src/services/CheckoutService.js:55:9
         const resposta = await this.comTimeout(
           this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao, pedido.idempotencyKey)
         );
-        this.circuitBreaker?.registrarSucesso?.();
+        this.circuitBreaker.registrarSucesso?.();
         return resposta;
       } catch (error) {

[Killed] BlockStatement
src/services/CheckoutService.js:57:23
         );
         this.circuitBreaker?.registrarSucesso?.();
         return resposta;
-      } catch (error) {
-        console.error('Falha no gateway de pagamento:', error.message);
-        this.circuitBreaker?.registrarFalha?.();
-
-        if (tentativa === totalTentativas) {
-          return null;
-        }
-
-        await this.esperar(this.calcularBackoffComJitter(tentativa));
-      }
+      } catch (error) {}
     }
 
killedBy: CheckoutService.processar - resiliencia e caos usa backoff com jitter entre tentativas de gateway
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 15

Number of calls: 0

[Killed] OptionalChaining
src/services/CheckoutService.js:59:9
         return resposta;
       } catch (error) {
         console.error('Falha no gateway de pagamento:', error.message);
-        this.circuitBreaker?.registrarFalha?.();
+        this.circuitBreaker.registrarFalha?.();
 
         if (tentativa === totalTentativas) {
killedBy: CheckoutService.processar - resiliencia e caos recupera erro transitorio de infraestrutura com retry e conclui como PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'registrarFalha')

[Killed] OptionalChaining
src/services/CheckoutService.js:59:9
         return resposta;
       } catch (error) {
         console.error('Falha no gateway de pagamento:', error.message);
-        this.circuitBreaker?.registrarFalha?.();
+        this.circuitBreaker?.registrarFalha();
 
         if (tentativa === totalTentativas) {
killedBy: CheckoutService - reforco de mutacao falha graciosamente mesmo se o circuit breaker nao expoe registrarFalha
statusReason: TypeError: this.circuitBreaker?.registrarFalha is not a function

[Killed] ConditionalExpression
src/services/CheckoutService.js:61:13
         console.error('Falha no gateway de pagamento:', error.message);
         this.circuitBreaker?.registrarFalha?.();
 
-        if (tentativa === totalTentativas) {
+        if (false) {
           return null;
         }
killedBy: CheckoutService - contratos adicionais para teste de mutacao nao aplica backoff apos a ultima tentativa de gateway
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: 1

[Killed] BlockStatement
src/services/CheckoutService.js:61:44
         console.error('Falha no gateway de pagamento:', error.message);
         this.circuitBreaker?.registrarFalha?.();
 
-        if (tentativa === totalTentativas) {
-          return null;
-        }
+        if (tentativa === totalTentativas) {}
 
         await this.esperar(this.calcularBackoffComJitter(tentativa));
killedBy: CheckoutService - contratos adicionais para teste de mutacao nao aplica backoff apos a ultima tentativa de gateway
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: 1

[Timeout] BlockStatement
src/services/CheckoutService.js:75:48
   comTimeout(operacao, timeoutMs = this.timeoutMs, mensagemErro = 'TIMEOUT_GATEWAY') {
     let timeoutId;
 
-    const timeout = new Promise((_, reject) => {
-      timeoutId = setTimeout(() => {
-        reject(new Error(mensagemErro));
-      }, timeoutMs);
-    });
+    const timeout = new Promise((_, reject) => {});
 
     return Promise.race([operacao, timeout]).finally(() => clearTimeout(timeoutId));

[Timeout] BlockStatement
src/services/CheckoutService.js:76:36
     let timeoutId;
 
     const timeout = new Promise((_, reject) => {
-      timeoutId = setTimeout(() => {
-        reject(new Error(mensagemErro));
-      }, timeoutMs);
+      timeoutId = setTimeout(() => {}, timeoutMs);
     });
 

[Killed] ArrowFunction
src/services/CheckoutService.js:81:54
       }, timeoutMs);
     });
 
-    return Promise.race([operacao, timeout]).finally(() => clearTimeout(timeoutId));
+    return Promise.race([operacao, timeout]).finally(() => undefined);
   }
 
killedBy: CheckoutService - contratos adicionais para teste de mutacao limpa o timeout quando a operacao termina antes do limite
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/services/CheckoutService.js:84:21
     return Promise.race([operacao, timeout]).finally(() => clearTimeout(timeoutId));
   }
 
-  persistir(pedido) {
-    return this.comTimeout(
-      this.pedidoRepository.salvar(pedido),
-      this.repoTimeoutMs,
-      'TIMEOUT_REPOSITORIO'
-    );
-  }
+  persistir(pedido) {}
 
   calcularBackoffComJitter(tentativa) {
killedBy: CheckoutService.processar - resiliencia e caos recupera erro transitorio de infraestrutura com retry e conclui como PROCESSADO
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] StringLiteral
src/services/CheckoutService.js:88:7
     return this.comTimeout(
       this.pedidoRepository.salvar(pedido),
       this.repoTimeoutMs,
-      'TIMEOUT_REPOSITORIO'
+      ""
     );
   }
killedBy: CheckoutService - timeout em todas as chamadas externas nao trava quando o repositorio nao responde ao salvar erro de gateway
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao persistir status de erro do pedido:", "TIMEOUT_REPOSITORIO"
Received
       1: "Falha no gateway de pagamento:", "gateway indisponivel"
       2: "Falha ao persistir status de erro do pedido:", ""

Number of calls: 2

[Killed] BlockStatement
src/services/CheckoutService.js:92:39
     );
   }
 
-  calcularBackoffComJitter(tentativa) {
-    const backoffExponencial = this.retryDelayMs * (2 ** (tentativa - 1));
-    const variacaoMaxima = backoffExponencial * this.jitterRatio;
-    const jitter = this.random() * variacaoMaxima;
-
-    return Math.round(backoffExponencial + jitter);
-  }
+  calcularBackoffComJitter(tentativa) {}
 
   esperar(ms) {
killedBy: CheckoutService.processar - resiliencia e caos calcula backoff exponencial com jitter deterministico
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: undefined

[Killed] ArithmeticOperator
src/services/CheckoutService.js:93:59
   }
 
   calcularBackoffComJitter(tentativa) {
-    const backoffExponencial = this.retryDelayMs * (2 ** (tentativa - 1));
+    const backoffExponencial = this.retryDelayMs * (2 ** (tentativa + 1));
     const variacaoMaxima = backoffExponencial * this.jitterRatio;
     const jitter = this.random() * variacaoMaxima;
killedBy: CheckoutService.processar - resiliencia e caos calcula backoff exponencial com jitter deterministico
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 2200

[Killed] ArithmeticOperator
src/services/CheckoutService.js:93:32
   }
 
   calcularBackoffComJitter(tentativa) {
-    const backoffExponencial = this.retryDelayMs * (2 ** (tentativa - 1));
+    const backoffExponencial = this.retryDelayMs / 2 ** (tentativa - 1);
     const variacaoMaxima = backoffExponencial * this.jitterRatio;
     const jitter = this.random() * variacaoMaxima;
killedBy: CheckoutService.processar - resiliencia e caos calcula backoff exponencial com jitter deterministico
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1100
Received: 275

[Killed] ArithmeticOperator
src/services/CheckoutService.js:94:28
 
   calcularBackoffComJitter(tentativa) {
     const backoffExponencial = this.retryDelayMs * (2 ** (tentativa - 1));
-    const variacaoMaxima = backoffExponencial * this.jitterRatio;
+    const variacaoMaxima = backoffExponencial / this.jitterRatio;
     const jitter = this.random() * variacaoMaxima;
 
killedBy: CheckoutService.processar - resiliencia e caos calcula backoff exponencial com jitter deterministico
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 1750

[Killed] ArithmeticOperator
src/services/CheckoutService.js:95:20
   calcularBackoffComJitter(tentativa) {
     const backoffExponencial = this.retryDelayMs * (2 ** (tentativa - 1));
     const variacaoMaxima = backoffExponencial * this.jitterRatio;
-    const jitter = this.random() * variacaoMaxima;
+    const jitter = this.random() / variacaoMaxima;
 
     return Math.round(backoffExponencial + jitter);
killedBy: CheckoutService.processar - resiliencia e caos calcula backoff exponencial com jitter deterministico
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 500

[Killed] ArithmeticOperator
src/services/CheckoutService.js:97:23
     const variacaoMaxima = backoffExponencial * this.jitterRatio;
     const jitter = this.random() * variacaoMaxima;
 
-    return Math.round(backoffExponencial + jitter);
+    return Math.round(backoffExponencial - jitter);
   }
 
killedBy: CheckoutService.processar - resiliencia e caos calcula backoff exponencial com jitter deterministico
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 450

[Killed] BlockStatement
src/services/CheckoutService.js:100:15
     return Math.round(backoffExponencial + jitter);
   }
 
-  esperar(ms) {
-    return new Promise((resolve) => setTimeout(resolve, ms));
-  }
+  esperar(ms) {}
 
   enviarConfirmacaoSemBloquear(email) {
killedBy: CheckoutService - contratos adicionais para teste de mutacao esperar retorna uma Promise para manter o backoff assincrono
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Promise

Received value has no prototype
Received value: undefined

[Timeout] ArrowFunction
src/services/CheckoutService.js:101:24
   }
 
   esperar(ms) {
-    return new Promise((resolve) => setTimeout(resolve, ms));
+    return new Promise(() => undefined);
   }
 

[Killed] BlockStatement
src/services/CheckoutService.js:104:39
     return new Promise((resolve) => setTimeout(resolve, ms));
   }
 
-  enviarConfirmacaoSemBloquear(email) {
-    this.emailService
-      .enviarConfirmacao(email, 'Pagamento Aprovado')
-      .catch((error) => console.error('Falha ao enviar e-mail de confirmacao:', error.message));
-  }
+  enviarConfirmacaoSemBloquear(email) {}
 
   async registrarErroGateway(pedido) {
killedBy: CheckoutService - contratos adicionais para teste de mutacao registra falha de envio de e-mail sem rejeitar o fluxo principal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@entregasja.com", "Pagamento Aprovado"

Number of calls: 0

[Killed] StringLiteral
src/services/CheckoutService.js:106:33
 
   enviarConfirmacaoSemBloquear(email) {
     this.emailService
-      .enviarConfirmacao(email, 'Pagamento Aprovado')
+      .enviarConfirmacao(email, "")
       .catch((error) => console.error('Falha ao enviar e-mail de confirmacao:', error.message));
   }
killedBy: CheckoutService.processar - fluxo de negocio processa pagamento aprovado, salva o pedido e dispara e-mail sem bloquear o retorno
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@entregasja.com", "Pagamento Aprovado"
Received: "cliente@entregasja.com", ""

Number of calls: 1
