[Killed] ArrowFunction
src/services/CheckoutService.js:107:14
   enviarConfirmacaoSemBloquear(email) {
     this.emailService
       .enviarConfirmacao(email, 'Pagamento Aprovado')
-      .catch((error) => console.error('Falha ao enviar e-mail de confirmacao:', error.message));
+      .catch(() => undefined);
   }
 
killedBy: CheckoutService - contratos adicionais para teste de mutacao registra falha de envio de e-mail sem rejeitar o fluxo principal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar e-mail de confirmacao:", "smtp fora"

Number of calls: 0

[Killed] BlockStatement
src/services/CheckoutService.js:110:38
       .catch((error) => console.error('Falha ao enviar e-mail de confirmacao:', error.message));
   }
 
-  async registrarErroGateway(pedido) {
-    pedido.status = 'ERRO_GATEWAY';
-
-    try {
-      await this.persistir(pedido);
-    } catch (error) {
-      console.error('Falha ao persistir status de erro do pedido:', error.message);
-    }
-
-    return null;
-  }
+  async registrarErroGateway(pedido) {}
 }
 
killedBy: CheckoutService - timeout em todas as chamadas externas nao trava quando o repositorio nao responde ao salvar erro de gateway
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:113:9
   async registrarErroGateway(pedido) {
     pedido.status = 'ERRO_GATEWAY';
 
-    try {
-      await this.persistir(pedido);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Falha ao persistir status de erro do pedido:', error.message);
     }
killedBy: CheckoutService.processar - resiliencia e caos aplica timeout, esgota retentativas e salva pedido como ERRO_GATEWAY
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "ERRO_GATEWAY"}

Number of calls: 0

[Killed] BlockStatement
src/services/CheckoutService.js:115:21
 
     try {
       await this.persistir(pedido);
-    } catch (error) {
-      console.error('Falha ao persistir status de erro do pedido:', error.message);
-    }
+    } catch (error) {}
 
     return null;
killedBy: CheckoutService - timeout em todas as chamadas externas nao trava quando o repositorio nao responde ao salvar erro de gateway
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao persistir status de erro do pedido:", "TIMEOUT_REPOSITORIO"
Received: "Falha no gateway de pagamento:", "gateway indisponivel"

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutService.js:124:32
 }
 
 class PagamentoAprovadoHandler {
-  constructor(checkoutService) {
-    this.checkoutService = checkoutService;
-  }
+  constructor(checkoutService) {}
 
   async processar(pedido) {
killedBy: CheckoutService.processar - resiliencia e caos recupera erro transitorio de infraestrutura com retry e conclui como PROCESSADO
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: null

[Killed] BlockStatement
src/services/CheckoutService.js:128:27
     this.checkoutService = checkoutService;
   }
 
-  async processar(pedido) {
-    pedido.status = 'PROCESSADO';
-    const pedidoSalvo = await this.checkoutService.persistir(pedido);
-
-    this.checkoutService.enviarConfirmacaoSemBloquear(pedido.clienteEmail);
-
-    return pedidoSalvo;
-  }
+  async processar(pedido) {}
 }
 
killedBy: CheckoutService - reforco de mutacao processa com sucesso mesmo se o circuit breaker nao expoe registrarSucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/services/CheckoutService.js:129:21
   }
 
   async processar(pedido) {
-    pedido.status = 'PROCESSADO';
+    pedido.status = "";
     const pedidoSalvo = await this.checkoutService.persistir(pedido);
 
killedBy: CheckoutService - reforco de mutacao processa com sucesso mesmo se o circuit breaker nao expoe registrarSucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: ""

[Killed] BlockStatement
src/services/CheckoutService.js:139:32
 }
 
 class PagamentoRecusadoHandler {
-  constructor(checkoutService) {
-    this.checkoutService = checkoutService;
-  }
+  constructor(checkoutService) {}
 
   async processar(pedido) {
killedBy: CheckoutService.processar - fluxo de negocio salva pedido como FALHOU e nao envia e-mail quando o cartao e recusado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "FALHOU"}
Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}, "clienteEmail": "cliente@entregasja.com", "status": "ERRO_GATEWAY", "valor": 120.5}

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutService.js:143:27
     this.checkoutService = checkoutService;
   }
 
-  async processar(pedido) {
-    pedido.status = 'FALHOU';
-    await this.checkoutService.persistir(pedido);
-    return null;
-  }
+  async processar(pedido) {}
 }
 
killedBy: CheckoutService.processar - fluxo de negocio salva pedido como FALHOU e nao envia e-mail quando o cartao e recusado
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ArrowFunction
src/services/CheckoutService.js:150:41
   }
 }
 
-const criarResultadoPagamentoHandlers = (checkoutService) => ({
-  APROVADO: new PagamentoAprovadoHandler(checkoutService),
-  RECUSADO: new PagamentoRecusadoHandler(checkoutService)
-});
+const criarResultadoPagamentoHandlers = () => undefined;
 
 module.exports = { CheckoutService };
killedBy: CheckoutService.processar - resiliencia e caos recupera erro transitorio de infraestrutura com retry e conclui como PROCESSADO
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: null

[Killed] ObjectLiteral
src/services/CheckoutService.js:150:63
   }
 }
 
-const criarResultadoPagamentoHandlers = (checkoutService) => ({
-  APROVADO: new PagamentoAprovadoHandler(checkoutService),
-  RECUSADO: new PagamentoRecusadoHandler(checkoutService)
-});
+const criarResultadoPagamentoHandlers = (checkoutService) => ({});
 
 module.exports = { CheckoutService };
killedBy: CheckoutService - contratos adicionais para teste de mutacao registra ERRO_GATEWAY quando a persistencia falha apos pagamento aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao persistir ou finalizar pedido:", "db indisponivel"
Received
       1: "Falha ao persistir ou finalizar pedido:", "Cannot read properties of undefined (reading 'processar')"
       2: "Falha ao persistir status de erro do pedido:", "db indisponivel"

Number of calls: 2
