[Killed] BlockStatement
src/services/CircuitBreaker.js:2:29
 class CircuitBreaker {
-  constructor(options = {}) {
-    this.threshold = options.threshold ?? 0.5;
-    this.minimumRequests = options.minimumRequests ?? 5;
-    this.resetTimeoutMs = options.resetTimeoutMs ?? 30000;
-    this.now = options.now ?? Date.now;
-    this.estado = 'FECHADO';
-    this.sucessos = 0;
-    this.falhas = 0;
-    this.abertoDesde = null;
-  }
+  constructor(options = {}) {}
 
   isOpen() {
killedBy: CircuitBreaker comeca fechado e permite chamadas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: undefined

[Killed] LogicalOperator
src/services/CircuitBreaker.js:3:22
 class CircuitBreaker {
   constructor(options = {}) {
-    this.threshold = options.threshold ?? 0.5;
+    this.threshold = options.threshold && 0.5;
     this.minimumRequests = options.minimumRequests ?? 5;
     this.resetTimeoutMs = options.resetTimeoutMs ?? 30000;
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/CircuitBreaker.js:4:28
 class CircuitBreaker {
   constructor(options = {}) {
     this.threshold = options.threshold ?? 0.5;
-    this.minimumRequests = options.minimumRequests ?? 5;
+    this.minimumRequests = options.minimumRequests && 5;
     this.resetTimeoutMs = options.resetTimeoutMs ?? 30000;
     this.now = options.now ?? Date.now;
killedBy: CheckoutService + CircuitBreaker breaker real abre apos falhas e passa a bloquear o gateway
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/CircuitBreaker.js:5:27
   constructor(options = {}) {
     this.threshold = options.threshold ?? 0.5;
     this.minimumRequests = options.minimumRequests ?? 5;
-    this.resetTimeoutMs = options.resetTimeoutMs ?? 30000;
+    this.resetTimeoutMs = options.resetTimeoutMs && 30000;
     this.now = options.now ?? Date.now;
     this.estado = 'FECHADO';
killedBy: CircuitBreaker passa a meio-aberto e permite uma tentativa apos o cooldown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/services/CircuitBreaker.js:6:16
     this.threshold = options.threshold ?? 0.5;
     this.minimumRequests = options.minimumRequests ?? 5;
     this.resetTimeoutMs = options.resetTimeoutMs ?? 30000;
-    this.now = options.now ?? Date.now;
+    this.now = options.now && Date.now;
     this.estado = 'FECHADO';
     this.sucessos = 0;
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: TypeError: this.now is not a function

[Killed] BlockStatement
src/services/CircuitBreaker.js:13:12
     this.abertoDesde = null;
   }
 
-  isOpen() {
-    if (this.estado !== 'ABERTO') {
-      return false;
-    }
-
-    if (this.now() - this.abertoDesde >= this.resetTimeoutMs) {
-      this.estado = 'MEIO_ABERTO';
-      return false;
-    }
-
-    return true;
-  }
+  isOpen() {}
 
   registrarSucesso() {
killedBy: CircuitBreaker comeca fechado e permite chamadas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/services/CircuitBreaker.js:14:35
   }
 
   isOpen() {
-    if (this.estado !== 'ABERTO') {
-      return false;
-    }
+    if (this.estado !== 'ABERTO') {}
 
     if (this.now() - this.abertoDesde >= this.resetTimeoutMs) {
killedBy: CircuitBreaker comeca fechado e permite chamadas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:14:9
   }
 
   isOpen() {
-    if (this.estado !== 'ABERTO') {
+    if (false) {
       return false;
     }
killedBy: CircuitBreaker comeca fechado e permite chamadas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] BooleanLiteral
src/services/CircuitBreaker.js:15:14
 
   isOpen() {
     if (this.estado !== 'ABERTO') {
-      return false;
+      return true;
     }
 
killedBy: CircuitBreaker comeca fechado e permite chamadas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/CircuitBreaker.js:18:9
       return false;
     }
 
-    if (this.now() - this.abertoDesde >= this.resetTimeoutMs) {
+    if (this.now() - this.abertoDesde > this.resetTimeoutMs) {
       this.estado = 'MEIO_ABERTO';
       return false;
killedBy: CircuitBreaker passa a meio-aberto e permite uma tentativa apos o cooldown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:18:9
       return false;
     }
 
-    if (this.now() - this.abertoDesde >= this.resetTimeoutMs) {
+    if (true) {
       this.estado = 'MEIO_ABERTO';
       return false;
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/services/CircuitBreaker.js:19:21
     }
 
     if (this.now() - this.abertoDesde >= this.resetTimeoutMs) {
-      this.estado = 'MEIO_ABERTO';
+      this.estado = "";
       return false;
     }
killedBy: CircuitBreaker passa a meio-aberto e permite uma tentativa apos o cooldown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MEIO_ABERTO"
Received: ""

[Killed] BooleanLiteral
src/services/CircuitBreaker.js:20:14
 
     if (this.now() - this.abertoDesde >= this.resetTimeoutMs) {
       this.estado = 'MEIO_ABERTO';
-      return false;
+      return true;
     }
 
killedBy: CircuitBreaker passa a meio-aberto e permite uma tentativa apos o cooldown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/CircuitBreaker.js:26:22
     return true;
   }
 
-  registrarSucesso() {
-    if (this.estado === 'MEIO_ABERTO') {
-      this._fechar();
-      return;
-    }
-
-    this.sucessos += 1;
-    this._avaliar();
-  }
+  registrarSucesso() {}
 
   registrarFalha() {
killedBy: CircuitBreaker abre quando a taxa de falha ultrapassa 50% apos o volume minimo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CircuitBreaker.js:27:40
   }
 
   registrarSucesso() {
-    if (this.estado === 'MEIO_ABERTO') {
-      this._fechar();
-      return;
-    }
+    if (this.estado === 'MEIO_ABERTO') {}
 
     this.sucessos += 1;
killedBy: CircuitBreaker fecha novamente apos sucesso em meio-aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:27:9
   }
 
   registrarSucesso() {
-    if (this.estado === 'MEIO_ABERTO') {
+    if (false) {
       this._fechar();
       return;
killedBy: CircuitBreaker fecha novamente apos sucesso em meio-aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] AssignmentOperator
src/services/CircuitBreaker.js:32:5
       return;
     }
 
-    this.sucessos += 1;
+    this.sucessos -= 1;
     this._avaliar();
   }
killedBy: CircuitBreaker abre quando a taxa de falha ultrapassa 50% apos o volume minimo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CircuitBreaker.js:36:20
     this._avaliar();
   }
 
-  registrarFalha() {
-    if (this.estado === 'MEIO_ABERTO') {
-      this._abrir();
-      return;
-    }
-
-    this.falhas += 1;
-    this._avaliar();
-  }
+  registrarFalha() {}
 
   _avaliar() {
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:37:9
   }
 
   registrarFalha() {
-    if (this.estado === 'MEIO_ABERTO') {
+    if (false) {
       this._abrir();
       return;
killedBy: CircuitBreaker reabre apos falha em meio-aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "MEIO_ABERTO"

[Killed] AssignmentOperator
src/services/CircuitBreaker.js:42:5
       return;
     }
 
-    this.falhas += 1;
+    this.falhas -= 1;
     this._avaliar();
   }
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CircuitBreaker.js:46:14
     this._avaliar();
   }
 
-  _avaliar() {
-    const total = this.sucessos + this.falhas;
-
-    if (total >= this.minimumRequests && this.falhas / total > this.threshold) {
-      this._abrir();
-    }
-  }
+  _avaliar() {}
 
   _abrir() {
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/services/CircuitBreaker.js:47:19
   }
 
   _avaliar() {
-    const total = this.sucessos + this.falhas;
+    const total = this.sucessos - this.falhas;
 
     if (total >= this.minimumRequests && this.falhas / total > this.threshold) {
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/services/CircuitBreaker.js:49:9
   _avaliar() {
     const total = this.sucessos + this.falhas;
 
-    if (total >= this.minimumRequests && this.falhas / total > this.threshold) {
+    if (total < this.minimumRequests && this.falhas / total > this.threshold) {
       this._abrir();
     }
killedBy: CircuitBreaker nao abre antes de atingir o volume minimo de requisicoes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/CircuitBreaker.js:49:42
   _avaliar() {
     const total = this.sucessos + this.falhas;
 
-    if (total >= this.minimumRequests && this.falhas / total > this.threshold) {
+    if (total >= this.minimumRequests && this.falhas / total >= this.threshold) {
       this._abrir();
     }
killedBy: CircuitBreaker nao abre quando a taxa de falha fica em 50% ou menos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/CircuitBreaker.js:54:12
     }
   }
 
-  _abrir() {
-    this.estado = 'ABERTO';
-    this.abertoDesde = this.now();
-    this.sucessos = 0;
-    this.falhas = 0;
-  }
+  _abrir() {}
 
   _fechar() {
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/services/CircuitBreaker.js:55:19
   }
 
   _abrir() {
-    this.estado = 'ABERTO';
+    this.estado = "";
     this.abertoDesde = this.now();
     this.sucessos = 0;
killedBy: CircuitBreaker abre usando o threshold padrao (0.5) quando nenhum e informado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CircuitBreaker.js:61:13
     this.falhas = 0;
   }
 
-  _fechar() {
-    this.estado = 'FECHADO';
-    this.sucessos = 0;
-    this.falhas = 0;
-  }
+  _fechar() {}
 
   get estadoAtual() {
killedBy: CircuitBreaker fecha novamente apos sucesso em meio-aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] BlockStatement
src/services/CircuitBreaker.js:67:21
     this.falhas = 0;
   }
 
-  get estadoAtual() {
-    return this.estado;
-  }
+  get estadoAtual() {}
 }
 
killedBy: CircuitBreaker comeca fechado e permite chamadas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: undefined
