[Killed] BlockStatement
src/services/GatewayPagamentoHttp.js:9:65
 // deve usar https://. O http:// e aceito apenas no ambiente simulado (rede
 // interna do docker-compose via Toxiproxy). Ver secao de seguranca no README.
 class GatewayPagamentoHttp {
-  constructor({ baseUrl, fetchImpl = fetch, timeoutMs = 3000 }) {
-    this.baseUrl = baseUrl;
-    this.fetchImpl = fetchImpl;
-    this.timeoutMs = timeoutMs;
-  }
+  constructor({ baseUrl, fetchImpl = fetch, timeoutMs = 3000 }) {}
 
   async cobrar(valor, cartao, idempotencyKey) {
killedBy: GatewayPagamentoHttp cobra via POST e retorna o JSON do gateway
statusReason: TypeError: this.fetchImpl is not a function

[Killed] ArrowFunction
src/services/GatewayPagamentoHttp.js:19:30
     // AbortController garante que um gateway lento/pendurado tenha o socket
     // efetivamente fechado no timeout, evitando exaustao de conexoes sob carga.
     const controller = new AbortController();
-    const timer = setTimeout(() => controller.abort(), this.timeoutMs);
+    const timer = setTimeout(() => undefined, this.timeoutMs);
 
     try {
killedBy: GatewayPagamentoHttp aborta a requisicao e fecha o socket quando excede o timeout
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/services/GatewayPagamentoHttp.js:21:9
     const controller = new AbortController();
     const timer = setTimeout(() => controller.abort(), this.timeoutMs);
 
-    try {
-      const resposta = await this.fetchImpl(`${this.baseUrl}/cobrar`, {
-        method: 'POST',
-        headers: {
-          'Content-Type': 'application/json',
-          'Idempotency-Key': idempotencyKey ?? ''
-        },
-        body: JSON.stringify({ valor, cartao }),
-        signal: controller.signal
-      });
-
-      if (!resposta.ok) {
-        throw new Error(`GATEWAY_HTTP_${resposta.status}`);
-      }
-
-      return await resposta.json();
-    } catch (error) {
+    try {} catch (error) {
       if (error.name === 'AbortError') {
         throw new Error('GATEWAY_TIMEOUT');
killedBy: GatewayPagamentoHttp cobra via POST e retorna o JSON do gateway
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"status": "APROVADO"}
Received: undefined

[Killed] ObjectLiteral
src/services/GatewayPagamentoHttp.js:24:18
     try {
       const resposta = await this.fetchImpl(`${this.baseUrl}/cobrar`, {
         method: 'POST',
-        headers: {
-          'Content-Type': 'application/json',
-          'Idempotency-Key': idempotencyKey ?? ''
-        },
+        headers: {},
         body: JSON.stringify({ valor, cartao }),
         signal: controller.signal
killedBy: GatewayPagamentoHttp envia a chave de idempotencia no header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "idem-1"
Received: undefined

[Killed] LogicalOperator
src/services/GatewayPagamentoHttp.js:26:30
         method: 'POST',
         headers: {
           'Content-Type': 'application/json',
-          'Idempotency-Key': idempotencyKey ?? ''
+          'Idempotency-Key': idempotencyKey && ''
         },
         body: JSON.stringify({ valor, cartao }),
killedBy: GatewayPagamentoHttp envia a chave de idempotencia no header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "idem-1"
Received: ""

[Killed] ObjectLiteral
src/services/GatewayPagamentoHttp.js:28:30
           'Content-Type': 'application/json',
           'Idempotency-Key': idempotencyKey ?? ''
         },
-        body: JSON.stringify({ valor, cartao }),
+        body: JSON.stringify({}),
         signal: controller.signal
       });
killedBy: GatewayPagamentoHttp envia Content-Type application/json e o corpo serializado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"valor\":100,\"cartao\":{\"numero\":\"4111\"}}"
Received: "{}"

[Killed] ConditionalExpression
src/services/GatewayPagamentoHttp.js:32:11
         signal: controller.signal
       });
 
-      if (!resposta.ok) {
+      if (true) {
         throw new Error(`GATEWAY_HTTP_${resposta.status}`);
       }
killedBy: GatewayPagamentoHttp cobra via POST e retorna o JSON do gateway
statusReason: Error: GATEWAY_HTTP_200

[Killed] ConditionalExpression
src/services/GatewayPagamentoHttp.js:32:11
         signal: controller.signal
       });
 
-      if (!resposta.ok) {
+      if (false) {
         throw new Error(`GATEWAY_HTTP_${resposta.status}`);
       }
killedBy: GatewayPagamentoHttp lanca erro quando o gateway responde status nao-ok (aciona retry/circuit breaker)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {}

[Killed] StringLiteral
src/services/GatewayPagamentoHttp.js:33:25
       });
 
       if (!resposta.ok) {
-        throw new Error(`GATEWAY_HTTP_${resposta.status}`);
+        throw new Error(``);
       }
 
killedBy: GatewayPagamentoHttp lanca erro quando o gateway responde status nao-ok (aciona retry/circuit breaker)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GATEWAY_HTTP_503"
Received message:   ""

       99 |             } else {
      100 |               stryCov_9fa48("408");
    > 101 |               throw new Error(stryMutAct_9fa48("409") ? `` : (stryCov_9fa48("409"), `GATEWAY_HTTP_${resposta.status}`));

[Killed] BlockStatement
src/services/GatewayPagamentoHttp.js:37:21
       }
 
       return await resposta.json();
-    } catch (error) {
-      if (error.name === 'AbortError') {
-        throw new Error('GATEWAY_TIMEOUT');
-      }
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       clearTimeout(timer);
     }
killedBy: GatewayPagamentoHttp lanca erro quando o gateway responde status nao-ok (aciona retry/circuit breaker)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/services/GatewayPagamentoHttp.js:38:11
 
       return await resposta.json();
     } catch (error) {
-      if (error.name === 'AbortError') {
+      if (false) {
         throw new Error('GATEWAY_TIMEOUT');
       }
killedBy: GatewayPagamentoHttp aborta a requisicao e fecha o socket quando excede o timeout
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GATEWAY_TIMEOUT"
Received message:   "The operation was aborted"

      52 |     const fetchImpl = jest.fn((url, init) => new Promise((resolve, reject) => {
      53 |       init.signal.addEventListener('abort', () => {
    > 54 |         const erro = new Error('The operation was aborted');

[Killed] BlockStatement
src/services/GatewayPagamentoHttp.js:38:40
 
       return await resposta.json();
     } catch (error) {
-      if (error.name === 'AbortError') {
-        throw new Error('GATEWAY_TIMEOUT');
-      }
+      if (error.name === 'AbortError') {}
       throw error;
     } finally {
killedBy: GatewayPagamentoHttp aborta a requisicao e fecha o socket quando excede o timeout
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GATEWAY_TIMEOUT"
Received message:   "The operation was aborted"

      52 |     const fetchImpl = jest.fn((url, init) => new Promise((resolve, reject) => {
      53 |       init.signal.addEventListener('abort', () => {
    > 54 |         const erro = new Error('The operation was aborted');

[Survived] BlockStatement
src/services/GatewayPagamentoHttp.js:42:15
         throw new Error('GATEWAY_TIMEOUT');
       }
       throw error;
-    } finally {
-      clearTimeout(timer);
-    }
+    } finally {}
   }
 }

[Killed] ObjectLiteral
src/services/GatewayPagamentoHttp.js:48:18
   }
 }
 
-module.exports = { GatewayPagamentoHttp };
+module.exports = {};
 
killedBy: GatewayPagamentoHttp cobra via POST e retorna o JSON do gateway
statusReason: TypeError: GatewayPagamentoHttp is not a constructor
